_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СценарииПланированияПроектовСтроительства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзMSProject</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьКритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовКритичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКодаСДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДлительностиЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КнопкаСоздатьСтарая = Элементы.Найти("ФормаСоздать");
	
	Если КнопкаСоздатьСтарая <> Неопределено Тогда  	
		
		Если ПолучитьФункциональнуюОпцию("УСОERP_ИспользоватьСтарыйВариантСценариев") Тогда
			
			НоваяГруппа = Элементы.Вставить("ГруппаСоздать",Тип("ГруппаФормы"),Элементы.ФормаКоманднаяПанель,КнопкаСоздатьСтарая);
			НоваяГруппа.Заголовок = "Создать";
			
			Элементы.Переместить(Элементы.СписокКомандаСоздать_НовыйВариант,НоваяГруппа);
			Элементы.Переместить(КнопкаСоздатьСтарая,НоваяГруппа);
			
		Иначе
			
			Элементы.Переместить(Элементы.СписокКомандаСоздать_НовыйВариант,Элементы.ФормаКоманднаяПанель,КнопкаСоздатьСтарая);
			Элементы.СписокКомандаСоздать_НовыйВариант.Заголовок = "Создать";
			КнопкаСоздатьСтарая.Видимость = Ложь;
			Элементы["ФормаСкопировать"].Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.СписокКомандаСоздать_НовыйВариант.Видимость = ПравоДоступа("Добавление",Метаданные.Справочники.УСОERP_СценарииПланированияПроектовСтроительства);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НомерВерсии", 0, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
	Если Параметры.Свойство("ОбъектСтроительства") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.ОбъектСтроительства, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		ОбъектСтроительства = Параметры.ОбъектСтроительства;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ВидСценария") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидСценария", Параметры.ВидСценария, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ПометкаУдаления") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Параметры.ПометкаУдаления, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборВерсийДляОтчета") Тогда
		ОтборВерсийДляОтчета = Параметры.ОтборВерсийДляОтчета;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("НовыйВариант") Тогда
		
		НовыйВариант = Параметры.Отбор.НовыйВариант;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НовыйВариант", Истина);
		
	Иначе
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НовыйВариант", Ложь);
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НомерВерсии", 0, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтборВерсийДляОтчета = Истина Тогда
		
		ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаВыбораВерсий",Новый Структура("ОтборВерсийДляОтчета",Истина),ЭтаФорма.ВладелецФормы);
		Отказ = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НовыйВариант Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаЭлементаДинамическая",Новый Структура("НовыйВариант",Истина));
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздать_НовыйВариант(Команда)
	ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.Форма.ФормаЭлементаДинамическая",Новый Структура("НовыйВариант,Владелец",Истина,ОбъектСтроительства));
КонецПроцедуры
